Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The browser must use the `vertx-eventbus` JavaScript library to consume the message:
ja_jp: ブラウザは、メッセージを消費するために、 `vertx-eventbus` JavaScriptライブラリを使用する必要があります。

source: The browser script must set a header to identify the current request as a JavaScript request for a `499` status code to be returned when the `quarkus.oidc.authentication.java-script-auto-redirect` property is set to `false`.
ja_jp: `quarkus.oidc.authentication.java-script-auto-redirect` プロパティーが `false` に設定されている場合に `499` ステータスコードが返されるようにするには、ブラウザースクリプトで現在のリクエストを JavaScript リクエストとして識別するためのヘッダーを設定する必要があります。

source: The build cache can store the outputs of (cacheable) tasks in the local build cache. The _output_ of a task can be restored from the cache.
ja_jp: ビルドキャッシュは、（キャッシュ可能な）タスクの出力をローカルビルドキャッシュに保存することができます。タスクの _出力_ は、キャッシュから復元することができます。

source: The build file and the dependencies
ja_jp: ビルドファイルと依存関係

source: The build process is performed inside the {openshift} cluster. {project-name} fully supports using S2I to deploy {project-name} as a JVM application.
ja_jp: ビルドプロセスは{openshift}クラスタ内で実行されます。 {project-name}はS2Iを使用して{project-name}をJVMアプリケーションとしてデプロイすることを完全にサポートしています。

source: The build step dealing with the `Dev Services` should additionally register two runtime properties into the "io.quarkus.quarkus-oidc" namespace: `oidcProviderName` (for example, `Google`) and `oidcProviderUrlBase` (for example: `mycompany.devservices-google`) for the `OpenID Connect Card` to link to the Dev UI page representing your provider, for example:
ja_jp: `Dev Services` を処理するビルドステップでは、 `OpenID Connect Card` をプロバイダーを示す Dev UI ページにリンクするために、2 つのランタイムプロパティーを "io.quarkus.quarkus-oidc" 名前空間に追加で登録する必要があります: `oidcProviderName` (例: `Google`) と `oidcProviderUrlBase` (例: `mycompany.devservices-google`)。

source: The build step that is automatically generated is easy to understand. It produces a `FeatureBuildItem` which will be consumed by Quarkus startup and you will see the extension name in the list displayed by Quarkus at startup:
ja_jp: 自動的に生成されるビルドステップはわかりやすいです。これは、Quarkusの起動時に消費される `FeatureBuildItem` を生成し、起動時にQuarkusが表示するリストにエクステンションの名前が表示されます。

source: The build step will be run with a TCCL that can load user classes from the deployment in a transformer-safe way. This class loader only lasts for the life of the augmentation, and is discarded afterwards. The classes will be loaded again in a different class loader at runtime. This means that loading a class during augmentation does not stop it from being transformed when running in the development/test mode.
ja_jp: ビルドステップは、トランスフォーマーセーフな方法でデプロイメントからユーザークラスをロードできる TCCL を使用して実行されます。このクラスローダーは、オーグメンテーションの存続期間中のみ存在し、その後破棄されます。クラスは、実行時に別のクラスローダーに再度ロードされます。これは、オーグメンテーション中にクラスをロードしても、開発/テストモードで実行している場合はクラスの変換が停止しないことを意味します。

source: The build that is performed is a _s2i binary_ build. The input of the build is the JAR file that has been built locally and the build output is an `ImageStream` that is configured to automatically trigger a deployment. The base or builder image is specified by using `base-jvm-image` and `base-native-image` for JVM and native mode respectively. An `ImageStream` for the image is automatically generated, unless these properties are used to reference an existing `ImageStreamTag` in the internal openshift registry. For example:
ja_jp: 実行されるビルドは、 _s2iバイナリビルド_ です。 ビルドの入力はローカルでビルドされたJARファイルで、ビルドの出力は自動的にデプロイをトリガーするように設定された `ImageStream` です。 ベースイメージまたはビルダーイメージは、それぞれ JVM 用に `base-jvm-image` を、ネイティブモード用に `base-native-image` を使って指定します。 これらのプロパティがopenshift内部レジストリの既存の `ImageStreamTag` を参照するために使用されない限り、イメージ用の `ImageStream` が自動的に生成されます。 例:

source: The build that will be performed is a _s2i binary_ build. The input of the build is the jar that has been built locally and the output of the build is an `ImageStream` that is configured to automatically trigger a deployment.
ja_jp: 実行されるビルドは、 _s2iバイナリ_ ビルドです。ビルドの入力は、ローカルでビルドされたjarで、ビルドの出力は、デプロイメントを自動的に起動するように設定された `ImageStream` です。

source: The build that will be performed is a _s2i binary_ build. The input of the build is the jar that has been built locally and the output of the build is an `ImageStream` that is configured to automatically trigger a deployment. The base/builder image is specified using `base-jvm-image` and `base-native-image` for jvm and native mode respectively. An ImageStream for the image is automatically generated, unless these properties are used to reference an existing ImageStreamTag in the internal openshift registry. For example:
ja_jp: 実行されるビルドは _s2iバイナリビルド_ です。 ビルドの入力はローカルでビルドされたjarで、ビルドの出力は自動的にデプロイをトリガーするように設定された `ImageStream` です。 ベース/ビルダーイメージは、それぞれjvmモード用には `base-jvm-image` 、ネイティブモード用には `base-native-image` です。これらのプロパティを使用して、openshift 内部レジストリの既存の ImageStreamTag を参照しない限り、イメージ用の ImageStream が自動的に生成されます。例:

source: The build that will be performed is an _s2i binary_ build. The input of the build is the jar that has been built locally and the output of the build is an `ImageStream` that is configured to automatically trigger a deployment.
ja_jp: 実行されるビルドは _s2iバイナリビルド_ です。ビルドの入力はローカルでビルドされたjarで、ビルドの出力は自動的にデプロイをトリガーするように設定された `ImageStream` です。

source: The build time approach favors the principle of "immutable security" where the appropriate certificates are added at build time, and can never be changed afterward. This guarantees that the list of valid certificates cannot be tampered with when the application gets deployed in production.
ja_jp: ビルド時アプローチでは、適切な証明書がビルド時に追加され、その後は決して変更できないという「不変のセキュリティ」の原則を採用しています。これにより、アプリケーションが本番環境にデプロイされる際に、有効な証明書のリストが改ざんされないことが保証されます。

source: The build time corresponds to all the actions you apply to your Java source files to convert them into something runnable (class files, jar/war, native images). Usually this stage is composed by the compilation, annotation processing, bytecode generation, etc. At this point, everything is under the developer's scope and control.
ja_jp: ビルド時は、Javaソース・ファイルを実行可能なもの（クラス・ファイル、jar/war、ネイティブ・イメージ）に変換するために適用するすべてのアクションに対応します。 通常、この段階はコンパイル、アノテーション処理、バイトコード生成などで構成されます。この時点では、すべてが開発者の範囲と制御下にあります。

source: The build-time principle and reactive core optimize CPU, memory, and system resource use, enabling high performance with fewer resources. This lowers operational costs in cloud environments and offers sustainability benefits through reduced resource consumption.
ja_jp: ビルド時原則とリアクティブコアは、CPU、メモリ、システムリソースの使用を最適化し、より少ないリソースで高いパフォーマンスを実現します。これにより、クラウド環境での運用コストが削減され、リソース消費の低減を通じて持続可能性のメリットも提供されます。

source: The build-time principle minimizes runtime memory use by eliminating unnecessary components and precomputing at build time, reducing class loading and memory allocations. The reactive core further cuts memory usage by using a few event loops instead of a large thread pool, allowing the application to handle higher loads with a smaller memory footprint and enabling high deployment density.
ja_jp: ビルド時原則は、不要なコンポーネントを排除し、ビルド時に事前計算を行うことで、ランタイムのメモリ使用量を最小限に抑え、クラスロードとメモリ割り当てを削減します。リアクティブコアは、多数のスレッドプールではなく少数のイベントループを使用することで、メモリ使用量をさらに削減し、アプリケーションがより少ないメモリフットプリントでより高い負荷を処理できるようにし、高いデプロイ密度を可能にします。

source: The builder automatically sets the following claims if they are not explicitly configured:
ja_jp: 明示的に設定されていない場合、ビルダーは次のクレームを自動的に設定します。

source: The builder image tag of GraalVM to use e.g. `22.3-java17`. Use a `java17` version.
ja_jp: 使用するGraalVMのビルダーイメージタグ。例: `22.3-java17` 。 `java17` バージョンを使用して下さい。

source: The builder image tag of GraalVM to use e.g. `jdk-17`.
ja_jp: 使用する GraalVM のビルダーイメージタグ (例: `jdk-17`)。

source: The builder will also set `iat` (issued at) to the current time, `exp` (expires at) to 5 minutes away from the current time (it can be customized with the `smallrye.jwt.new-token.lifespan` property) and `jti` (unique token identifier) claims if they have not already been set.
ja_jp: ビルダーは、 `iat` (発行日) を現在の時刻に設定し、 `exp` (有効期限) を現在の時刻から 5 分後に設定し (`smallrye.jwt.new-token.lifespan` プロパティーでカスタマイズ可能)、未設定の場合は `jti` (一意のトークン識別子) クレームも設定します。

source: The built artifact is a jar (and not a container or native binary).
ja_jp: ビルドされたアーティファクトがjarであること（コンテナやネイティブバイナリではないこと）。

source: The bulk API's delete operation JSON already contains all the required information; hence, there is no request body following this operation in the Bulk API request body.
ja_jp: バルクAPIの削除操作のJSONには、すでに必要な情報がすべて含まれています。したがって、バルクAPIのリクエストボディには、この操作に続くリクエストボディはありません。

source: The bulk of the code is implemented in the `analytics-common` module. Data is sent using calls to `io.quarkus.analytics.AnalyticsService.sendAnalytics(...)` from the Maven and Gradle plugins.
ja_jp: コードの大部分は `analytics-common` モジュールに実装されています。データはMavenとGradleプラグインから `io.quarkus.analytics.AnalyticsService.sendAnalytics(…​)` を呼び出すことで送信されます。

source: The bulk of the file name should be some representation of its title. Use all lowercase letters, separate words with hyphens, and avoid symbols and special characters.
ja_jp: ファイル名の大部分は、そのタイトルを何らかの形で表現する必要があります。すべて小文字で、単語はハイフンで区切り、記号や特殊文字は避けてください。

source: The bundle name is also used as a part of the name of a localized file, e.g. `Controller_index` in the `Controller_index_de.properties`.
ja_jp: バンドル名は、ローカライズされたファイル名の一部としても使用されます。例えば、 `Controller_index` は、 `Controller_index_de.properties` となります。

source: The bundle name is defaulted unless it's specified with `@MessageBundle#value()`. For a top-level class the `msg` value is used by default. For a nested class the name consists of the simple names of all enclosing classes in the hierarchy (top-level class goes first), followed by the simple name of the message bundle interface. Names are separated by underscores.
ja_jp: `@MessageBundle#value()` で指定されていない限り、バンドル名がデフォルトになります。 最上位クラスの場合、デフォルトで `msg` 値が使用されます。 ネストされたクラスの場合、名前は階層内に含まれるすべてのクラスの単純名 (最上位クラスが最初) で設定され、その後にメッセージバンドルインターフェイスの単純名が続きます。 名前はアンダースコアで区切られます。

source: The business logic is defined in a callback.
ja_jp: ビジネスロジックはコールバックで定義されます。

source: The business process will be responsible for encapsulating business logic of our microservice. It should provide complete set of steps to achieve a business goal. At the same time this is the entry point to the service that can be consumed by clients.
ja_jp: ビジネスプロセスは、マイクロサービスのビジネスロジックをカプセル化する責任があります。これは、ビジネス目標を達成するためのステップの完全なセットを提供する必要があります。同時に、これはクライアントが消費することができるサービスへの入り口となります。

source: The cache extension also allows you to define a global default cache configuration that will be applied to all your caches.
ja_jp: また、キャッシュエクステンションでは、すべてのキャッシュに適用されるグローバルなデフォルトキャッシュ設定を定義することができます。

source: The cache key is explicitly composed of two elements. The method signature also contains a third argument which is not part of the key.
ja_jp: キャッシュキーは明示的に 2 つの要素で構成されています。メソッドシグネチャには、キーの一部ではない第三引数も含まれています。

source: The cache key is implicit since there's no `@CacheKey` annotation.
ja_jp: `@CacheKey` アノテーションがないので、キャッシュキーは暗黙的です。

source: The cache keys from a specific `CaffeineCache` can be retrieved as an unmodifiable `Set` as shown below. If the cache entries are modified while an iteration over the set is in progress, the set will remain unchanged.
ja_jp: 特定の `CaffeineCache` からのキャッシュキーは、以下に示すように、変更不可能な `Set` として取得できます。セットに対するイテレーションが進行している間にキャッシュエントリが変更された場合、セットは変更されないままとなります。

source: The cache metrics collection is disabled by default. It can be enabled from the `application.properties` file:
ja_jp: デフォルトでは、キャッシュメトリクスの収集は無効になっています。 `application.properties` ファイルから有効にすることができます。

source: The cache metrics collection will only work if your application depends on a `quarkus-micrometer-registry-*` extension. See the xref:micrometer.adoc[Micrometer metrics guide] to learn how to use Micrometer in Quarkus.
ja_jp: キャッシュメトリクスコレクションは、アプリケーションが `quarkus-micrometer-registry-*` エクステンションに依存している場合にのみ動作します。Quarkusでのマイクロケーターの使用方法については、 xref:micrometer.adoc[Micrometerメトリクスガイド]を参照してください。

source: The cache metrics collection will only work if your application depends on a `quarkus-micrometer-registry-*` extension. See the xref:telemetry-micrometer.adoc[Micrometer metrics guide] to learn how to use Micrometer in Quarkus.
ja_jp: キャッシュ・メトリクスの収集は、アプリケーションが `quarkus-micrometer-registry-*` エクステンションに依存している場合にのみ機能します。QuarkusでMicrometerを使用する方法については、 xref:telemetry-micrometer.adoc[Micrometerメトリクスガイド] を参照してください。

source: The cache value from a specific `CaffeineCache` can be retrieved if present as shown below. If the given key is contained in the cache, the method will return the `CompletableFuture` the specified key is mapped to. That `CompletableFuture` may be computing or may already be completed. Otherwise, the method will return `null`.
ja_jp: 特定の `CaffeineCache` からのキャッシュ値は、以下に示すように存在する場合に取得できます。 与えられたキーがキャッシュに含まれている場合、このメソッドは指定されたキーがマッピングされた `CompletableFuture` を返します。 その `CompletableFuture` は計算中であるか、あるいは既に終了している可能性があります。 そうでなければ、このメソッドは `null` を返します。

source: The caching technology provided within Quarkus is currently quite rudimentary and limited.
ja_jp: Quarkusで提供されているキャッシュ技術は現在のところ非常に初歩的で制約があります。

source: The call method
ja_jp: 呼び出し方法

source: The call to obtain the user principal returns `null` if the caller is unauthenticated and `non-null` if the caller is authenticated.
ja_jp: ユーザープリンシパルを取得するためのこの呼び出しは、呼び出し元が認証されていない場合は `null` を返し、呼び出し元が認証されている場合は `non-null` を返します。

source: The call to obtain the user principal returns null if the caller is unauthenticated and non-null if the caller is authenticated.
ja_jp: ユーザープリンシパルを取得するためのこの呼び出しは、呼び出し元が認証されていない場合はnullを返し、呼び出し元が認証されている場合は非nullを返します。

source: The call to the `MyService#update` method succeeds, because the configured user has role `admin`.
ja_jp: `MyService#update` メソッドの呼び出しは成功します。これは、設定されたユーザーが `admin` ロールを持っているためです。

source: The callout functions for these anchors vary based on whether you call a local ID or the ID from another file, but the anchored ID creation remains the same.
ja_jp: これらのアンカーのコールアウト関数は、ローカル ID を呼び出すか、別のファイルの ID を呼び出すかによって異なりますが、アンカー ID の作成は同じままです。

source: The central idea behind Quarkus is to do at build-time what traditional frameworks do at runtime: configuration parsing, classpath scanning, feature toggle based on classloading, and so on.
ja_jp: Quarkus の中心的なアイデアは、従来のフレームワークが実行時に行うこと、すなわち設定の解析、クラスパスのスキャン、クラスローディングに基づく機能の切り替えなどを、ビルド時に行うことです。

source: The certificate chain's leaf certificate must have a common name equal to `www.quarkusio.com`. If this property is not configured then the truststore must contain the certificate chain's leaf certificate unless one or more custom `TokenCertificateValidator` implementations are registered.
ja_jp: 証明書チェーンのリーフ証明書の共通名は `www.quarkusio.com` にする必要があります。このプロパティーが設定されていない場合は、1 つ以上のカスタム `TokenCertificateValidator` 実装が登録されていない限り、トラストストアに証明書チェーンのリーフ証明書が含まれている必要があります。

source: The certificate is stored in `./.certs/`. Two files are generated:
ja_jp: 証明書は `./.certs/` に保存されます。 以下の 2 つのファイルが生成されます。

source: The certificate supplier is a runtime object generally retrieved by using a recorder method.
ja_jp: 証明書サプライヤーは、通常、レコーダーメソッドを使用して取得されるランタイムオブジェクトです。

source: The challenge
ja_jp: チャレンジ

source: The challenge is served from the primary HTTP interface (accessible from your DNS domain name).
ja_jp: チャレンジはプライマリー HTTP インターフェイス (DNS ドメイン名からアクセス可能) から提供されます。

source: The challenge is served from the primary HTTP interface, which is accessible from your DNS domain name.
ja_jp: このチャレンジは、DNS ドメイン名からアクセス可能プライマリー HTTP インターフェイスから提供されます。

source: The change to target Jakarta EE 10 brings two major improvements:
ja_jp: Jakarta EE 10をターゲットとした変更により、2つの大きな改善がもたらされました:

source: The check interval represents the period at which the traffic is computed, and a higher interval may result in less precise traffic shaping. Despite 0 being accepted (no accounting), it is recommended to set a positive value for the check interval, even if it is high since the precision of the traffic shaping depends on the period where the traffic is computed. In this case, a suggested value is something close to 5 or 10 minutes.
ja_jp: チェック間隔は、トラフィックが計算される期間を表し、間隔が大きいほど、トラフィックシェーピングの精度が低くなる可能性があります。 0が受け入れられるにもかかわらず（アカウンティングなし）、トラフィックシェーピングの精度はトラフィックが計算される期間に依存するため、チェック間隔には高くても正の値を設定することを推奨します。 この場合、5分または10分に近い値が推奨されます。

source: The checkpoint commit strategy tracks when a processing state is last persisted for each topic-partition. If an outstanding state change can not be persisted for `checkpoint.unsynced-state-max-age.ms` (default: 10000), the channel is marked unhealthy.
ja_jp: チェックポイントコミット戦略は、各トピックパーティションの処理状態が最後に永続化されたタイミングを追跡します。未解決の状態変更が `checkpoint.unsynced-state-max-age.ms` (デフォルト: 10000) の間、永続化できない場合、チャネルは不健全とマークされます。

source: The claims are encrypted using the content encryption key and a content encryption algorithm such as `A256GCM`.
ja_jp: クレームは、コンテンツ暗号鍵と A256GCM などのコンテンツ暗号化アルゴリズムを使用して暗号化されます。

source: The claims can be encrypted immediately or after the `JSON Web Encryption` headers have been set the same way as they can be signed. The only minor difference is that encrypting the claims always requires a `jwe()` `JwtEncryptionBuilder` transition given that the API has been optimized to support signing and inner-signing of the claims.
ja_jp: クレームは、すぐに暗号化することも、 `JSON Web Encryption` ヘッダーを署名するのと同じ方法で設定した後に暗号化することもできます。唯一の小さな違いは、API がクレームの署名と内部署名をサポートするように最適化されている場合、クレームの暗号化には常に `jwe()` `JwtEncryptionBuilder` 遷移が必要になることです。

source: The claims can be signed and then the nested JWT token encrypted by combining the sign and encrypt steps.
ja_jp: クレームに署名してから、署名と暗号化の手順を組み合わせて、ネストされた JWT トークンを暗号化できます。

source: The claims can be signed immediately or after the `JSON Web Signature` headers have been set:
ja_jp: クレームは、すぐに署名するか、 `JSON Web Signature` ヘッダーが設定された後に署名できます。

source: The class `org.acme.one.Model`
ja_jp: クラス `org.acme.one.Model`

source: The class `org.acme.two.Model`
ja_jp: クラス `org.acme.two.Model`

source: The class as written above, would not be automatically be used by any REST Client. To make it available to every REST Client of the application, the class needs to be annotated with `@Provider` (as long as `quarkus.rest-client-reactive.provider-autodiscovery` is not set to `false`). Alternatively, if the exception handling class should only apply to specific REST Client interfaces, you can either annotate the interfaces with `@RegisterProvider(MyResponseExceptionMapper.class)`, or register it using configuration using the `providers` property of the proper `quarkus.rest-client` configuration group.
ja_jp: 上記のクラスは、REST クライアントによって自動的に使用されることはありません。アプリケーションのすべての REST クライアントで使用できるようにするには、クラスに `@Provider` アノテーションを付ける必要があります (`quarkus.rest-client-reactive.provider-autodiscovery` が `false` に設定されていない場合)。または、例外処理クラスを特定の REST クライアントインターフェイスにのみ適用する必要がある場合は、インターフェイスに `@RegisterProvider(MyResponseExceptionMapper.class)` でアノテーションを付けるか、適切な `quarkus.rest-client` 設定グループの `providers` プロパティー設定を使用して登録できます。

source: The class as written above, would not be automatically be used by any REST Client. To make it available to every REST Client of the application, the class needs to be annotated with `@Provider` (as long as `quarkus.rest-client.provider-autodiscovery` is not set to `false`). Alternatively, if the exception handling class should only apply to specific REST Client interfaces, you can either annotate the interfaces with `@RegisterProvider(MyResponseExceptionMapper.class)`, or register it using configuration using the `providers` property of the proper `quarkus.rest-client` configuration group.
ja_jp: 上記のクラスは、REST Client によって自動的に使用されることはありません。アプリケーションのすべての REST Client で使用できるようにするには、クラスに `@Provider` アノテーションを付ける必要があります (`quarkus.rest-client.provider-autodiscovery` が `false` に設定されていない場合)。 または、例外処理クラスを特定の REST Client インターフェイスにのみ適用する必要がある場合は、インターフェイスに `@RegisterProvider(MyResponseExceptionMapper.class)` でアノテーションを付けるか、適切な `quarkus.rest-client` 設定グループの `providers` プロパティー設定を使用して登録できます。

source: The class as written above, would not be automatically used by any REST Client. To make it available to every REST Client of the application, the class needs to be annotated with `@Provider` (as long as `quarkus.rest-client.provider-autodiscovery` is not set to `false`). Alternatively, if the exception handling class should only apply to specific REST Client interfaces, you can either annotate the interfaces with `@RegisterProvider(MyResponseExceptionMapper.class)`, or register it using configuration using the `providers` property of the proper `quarkus.rest-client` configuration group.
ja_jp: 上記のクラスは、どの REST Client でも自動的に使用されません。アプリケーションのすべての REST Client で利用できるようにするには、クラスに `@Provider` アノテーションを付ける必要があります (`quarkus.rest-client.provider-autodiscovery` が `false` に設定されていない限り)。別の方法として、例外処理クラスを特定の REST Client インターフェイスにのみ適用する必要がある場合は、インターフェイスに `@RegisterProvider(MyResponseExceptionMapper.class)` とアノテーションを付けるか、適切な `quarkus.rest-client` 設定グループの `providers` 設定プロパティーを使用して設定で登録できます。

source: The class does not declare a logger field. During the application build, Quarkus creates a `private static final org.jboss.logging.Logger` field in each class that uses the `Log` API. Quarkus uses the fully qualified name of the calling class as the logger name. In this example, the logger name is `com.example.MyService`.
ja_jp: このクラスはロガーフィールドを宣言しません。アプリケーションのビルド中に、Quarkus は `Log` API を使用する各クラスに `private static final org.jboss.logging.Logger` フィールドを作成します。Quarkus は、呼び出し元のクラスの完全修飾名をロガー名として使用します。この例では、ロガー名は `com.example.MyService` です。

source: The class generation uses a tool named `protoc`, which is OS-specific. That's why we use the `os-maven-plugin` to target the executable compatible with the operating system.
ja_jp: クラス生成には、OS固有の `protoc` というツールを使用しています。そのため、OSと互換性のある実行ファイルを対象に `os-maven-plugin` を使用しています。

source: The class is very simple and only contains 2 fields and the associated getters and setters. Because we indicate that we produce JSON, the mapping to JSON is made automatically.
ja_jp: このクラスは非常にシンプルで、2つのフィールドとそれに関連するゲッターとセッターだけが含まれています。JSONを生成することを示しているので、JSONへのマッピングは自動的に行われます。

source: The class must either represent a CDI bean or declare a public no-args constructor. If it represents a CDI bean, then the key generator will be injected during the cache key computation. Otherwise, a new instance of the key generator will be created using its default constructor for each cache key computation.
ja_jp: このクラスは、CDI Bean を表すか、public no-args コンストラクタを宣言する必要があります。 それが CDI Bean を表している場合、キー・ジェネレータはキャッシュ・キーの計算中に注入されます。 そうでない場合は、キャッシュ・キーの計算ごとに、その既定のコンストラクタを使用してキー・ジェネレータの新しいインスタンスが作成されます。

source: The class preloading loads and initializes all the classes used by the application.
ja_jp: クラスプリロードは、アプリケーションが使用するすべてのクラスをロードし、初期化します。

source: The classes to preload are listed in two places:
ja_jp: プリロードするクラスは2か所に記載されています。

source: The classes we have just created describe the GraphQL schema which is a set of possible data (objects, fields, relationships) that a client can access.
ja_jp: 先ほど作成したクラスは、クライアントがアクセス可能なデータ（オブジェクト、フィールド、リレーションシップ）のセットであるGraphQLスキーマを記述しています。
